train: model v1.1.0
